In [182]:
import numpy as np
import pandas as pd

%matplotlib inline
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure
import seaborn as sns

In [183]:
from tqdm import tqdm # progress bar
from datetime import datetime 
import json
import os

In [184]:
from sklearn.ensemble import RandomForestClassifier

from sklearn import metrics
from sklearn import preprocessing
from sklearn.impute import SimpleImputer

In [185]:
# Read CSVs
fetch_from = './data/train.csv'
train = pd.read_csv(fetch_from)

fetch_from = './data/test.csv'
test = pd.read_csv(fetch_from)

In [186]:
# Avoid truncation of columns
def showAllData():
    pd.set_option('display.max_columns', 500);
    pd.set_option('display.max_rows', 500);
showAllData();

In [187]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [188]:
train.drop(columns='Name').describe(include=['O'])

         Sex  Ticket        Cabin Embarked
count    891     891          204      889
unique     2     681          147        3
top     male  347082  C23 C25 C27        S
freq     577       7            4      644

## Visualizations

Display scatter plot for the numerical variables

Display count plot ( bar plot ) for the categorical variables

In [189]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.250000,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.283300,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.925000,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.100000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.050000,NaN,S

In [190]:
# Replace categorical missing values with a constant
# Label Encode the categorical variables
# Replace the continous missing values with the mean

def edaBasic(data):
    for col in data.columns:
        if (data[col].dtype)=='object':
            imp = SimpleImputer(missing_values=np.nan, strategy='constant');
            data[col] = imp.fit_transform(data[[col]]).ravel();
            
            le = preprocessing.LabelEncoder();
            le.fit(data[col]);
            data[col] = le.transform(data[col]);
        else:
            imp = SimpleImputer(missing_values=np.nan, strategy='mean');
            data[col] = imp.fit_transform(data[[col]]).ravel();
    return data;
edaBasic(train);

In [203]:
ml.oob_score_

0.8428731762065096

In [227]:
ml = RandomForestClassifier(n_jobs=-1, min_samples_leaf=3, max_features=0.5, n_jobs=-1, oob_score=True)
# ml = RandomForestClassifier(n_estimators=100, max_depth=5,random_state=0)
ml.fit(train.drop(columns='Survived'), train['Survived'])
# ml.score(train.drop(columns='Survived'), train['Survived'])
ml.oob_score_
ml.score(train.drop(columns='Survived'), train['Survived'])

1.0

In [218]:
edaBasic(test);

In [219]:
prediction = ml.predict(test).astype(int);

In [220]:
submission = pd.DataFrame({'PassengerId':test['PassengerId'].astype(int),'Survived':prediction});
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [228]:
filename = 'Titanic Predictions 1.csv'

submission.to_csv(filename,index=False)

In [230]:
train.shape

(891, 12)